# Exercise: Analyzing Chinook Database

Preparation I've done:
 - Retrieve the dataset and load it
 - Load the %sql extension and point it at the database
 - Display the tables and an example query

Additional steps you might take:
 - Add libraries for visualization (matplotlib, seaborn, plotly)
 - Add libraries for statistics (numpy)
 - Explore the dataset using SQL and/or pandas

----

In [4]:
# Load chinook dataset and query it using SQL magic into pandas dataframes
import pandas as pd
import sqlite3
%load_ext sql

# Load data
conn = sqlite3.connect("chinook.sqlite")

# Tell %sql about the database
%sql sqlite:///chinook.sqlite

# Read data into a Pandas DataFrame
tables = %sql SELECT name FROM sqlite_master WHERE type='table';

# Print head
display(tables)

# Query to get the first 5 rows of the `albums` table
result = %sql SELECT * FROM albums LIMIT 5;

# Display query result, note that Pandas DataFrame is returned!
display(result)

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Running query in 'sqlite:///chinook.sqlite'

+-----------------+
|       name      |
+-----------------+
|      albums     |
| sqlite_sequence |
|     artists     |
|    customers    |
|    employees    |
|      genres     |
|     invoices    |
|  invoice_items  |
|   media_types   |
|    playlists    |
+-----------------+
Truncated to displaylimit of 10.

Running query in 'sqlite:///chinook.sqlite'

+---------+---------------------------------------+----------+
| AlbumId |                 Title                 | ArtistId |
+---------+---------------------------------------+----------+
|    1    | For Those About To Rock We Salute You |    1     |
|    2    |           Balls to the Wall           |    2     |
|    3    |           Restless and Wild           |    2     |
|    4    |           Let There Be Rock           |    1     |
|    5    |                Big Ones               |    3     |
+---------+---------------------------------------+----------+

1. Retrieve a list of all the tracks in the database, displaying only the track name and the name of the album it belongs to. Limit the result to the first 5 rows.
   > Operations: `SELECT`

In [7]:
q1 = %sql SELECT tracks.Name, albums.Title \
    FROM tracks \
    JOIN albums \
        ON tracks.AlbumId = albums.AlbumId \
    LIMIT 5;
display(q1)

Running query in 'sqlite:///chinook.sqlite'

+-----------------------------------------+---------------------------------------+
|                   Name                  |                 Title                 |
+-----------------------------------------+---------------------------------------+
| For Those About To Rock (We Salute You) | For Those About To Rock We Salute You |
|          Put The Finger On You          | For Those About To Rock We Salute You |
|             Let's Get It Up             | For Those About To Rock We Salute You |
|             Inject The Venom            | For Those About To Rock We Salute You |
|                Snowballed               | For Those About To Rock We Salute You |
+-----------------------------------------+---------------------------------------+

2. Find the total number of customers from each country. Display the country name and the corresponding count. Order the results by the count in descending order.
   > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`

In [14]:
q2 = %sql SELECT Country, Count(CustomerId) as Customer_Count FROM customers \
    GROUP BY Country \
    ORDER BY Customer_Count DESC;
display(q2)

Running query in 'sqlite:///chinook.sqlite'

+----------------+----------------+
|    Country     | Customer_Count |
+----------------+----------------+
|      USA       |       13       |
|     Canada     |       8        |
|     France     |       5        |
|     Brazil     |       5        |
|    Germany     |       4        |
| United Kingdom |       3        |
|    Portugal    |       2        |
|     India      |       2        |
| Czech Republic |       2        |
|     Sweden     |       1        |
+----------------+----------------+
Truncated to displaylimit of 10.

3. Identify the top 5 genres with the highest number of tracks. Display the genre name along with the total number of tracks for each genre.
   > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`

In [31]:
q3 = %sql SELECT genres.Name AS Genre_Name, COUNT(TrackID) AS Track_Count FROM tracks \
    JOIN genres ON tracks.GenreId = genres.GenreId \
    GROUP BY Genre_Name \
    ORDER BY Track_Count DESC
display(q3)

Running query in 'sqlite:///chinook.sqlite'

+--------------------+-------------+
|     Genre_Name     | Track_Count |
+--------------------+-------------+
|        Rock        |     1297    |
|       Latin        |     579     |
|       Metal        |     374     |
| Alternative & Punk |     332     |
|        Jazz        |     130     |
|      TV Shows      |      93     |
|       Blues        |      81     |
|     Classical      |      74     |
|       Drama        |      64     |
|      R&B/Soul      |      61     |
+--------------------+-------------+
Truncated to displaylimit of 10.

4. Determine the average invoice total for each customer, considering both the album and individual track purchases. Display the customer's first and last name along with the average invoice total. Order the results by the average invoice total in descending order.
   > Operations: `SELECT`, `AVG`, `JOIN`, `GROUP BY`, `ORDER BY`

In [37]:
q4 = %sql SELECT customers.FirstName || ' ' || customers.LastName AS Customer_Name, \
        ROUND(AVG(invoices.Total), 2) AS Avg_Invoice_Total \
    FROM customers \
    JOIN invoices ON customers.CustomerId = invoices.CustomerId \
    GROUP BY customers.CustomerId \
    ORDER BY Avg_Invoice_Total DESC;

display(q4)

Running query in 'sqlite:///chinook.sqlite'

+--------------------+-------------------+
|   Customer_Name    | Avg_Invoice_Total |
+--------------------+-------------------+
|    Helena Holý     |        7.09       |
| Richard Cunningham |        6.8        |
|     Luis Rojas     |        6.66       |
|  Ladislav Kovács   |        6.52       |
|   Hugh O'Reilly    |        6.52       |
|   Frank Ralston    |        6.23       |
|   Julia Barnett    |        6.23       |
|  Fynn Zimmermann   |        6.23       |
|  Puja Srivastava   |        6.11       |
|   Astrid Gruber    |        6.09       |
+--------------------+-------------------+
Truncated to displaylimit of 10.

5. Identify the customer who spent the most on music purchases. Display the customer's first and last name, along with the total amount spent.
   > Operations: `SELECT`, `SUM`, `JOIN`, `GROUP BY`, `ORDER BY`, `LIMIT`

In [38]:
q5 = %sql SELECT customers.FirstName || ' ' || customers.LastName AS Customer_Name, \
    SUM(invoices.Total) AS Total_Spent \
    FROM customers \
    JOIN invoices ON customers.CustomerId = invoices.CustomerId \
    GROUP BY customers.CustomerId \
    ORDER BY Total_Spent DESC LIMIT 1;

display(q5)

Running query in 'sqlite:///chinook.sqlite'

+---------------+-------------+
| Customer_Name | Total_Spent |
+---------------+-------------+
|  Helena Holý  |    49.62    |
+---------------+-------------+